app/graphql/mutations/create_card.rb

INSERT INTO "cards" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "graph"], ["created_at", "2021-02-16 09:33:04.943651"], ["updated_at", "2021-02-16 09:33:04.943651"]]
---
    def resolve(title:)
      Card.create!(title: title)