app/graphql/mutations/create_task.rb

    def resolve(card_id:, **params)
      # Task.create!(card_id: card_id, title: title, description: description)
      Task.create!(card_id: card_id, **params)
---
INSERT INTO "tasks" ("title", "created_at", "updated_at", "description", "card_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "GRAPHAFTERUPDATE"], ["created_at", "2021-02-20 08:54:12.827783"], ["updated_at", "2021-02-20 08:54:12.827783"], ["description", "gdhsg"], ["card_id", 8]]