app/graphql/mutations/destroy_card.rb

DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 9]]
---
    def resolve(id:)
      Card.destroy(id)