app/graphql/mutations/destroy_task.rb

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 11]]
---
    def resolve(id:)
      Task.destroy(id)