app/graphql/mutations/update_card.rb

    def resolve(id:, title:)
      # card = Card.find(id) if (Card.find(id).update({title: title}))

      Card.find(id).tap do |card|
        card.update(title: title)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "cards" SET "id" = $1, "title" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["id", 8], ["title", "GraphAfterUpdate"], ["updated_at", "2021-02-16 09:58:30.665807"], ["id", 1]]