app/graphql/mutations/update_task.rb

    def resolve(id:, **params)
      # card = Card.find(id) if (Card.find(id).update({title: title}))

      Task.find(id).tap do |task|
        task.update(params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Description"], ["updated_at", "2021-02-20 11:34:12.486713"], ["id", 25]]