app/graphql/types/query_type.rb

    def card(id:)
      Card.find(id)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]