app/views/cards/show.html.slim

ul.tasks-list
  - @card.tasks.each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."card_id" = $1  [["card_id", 1]]