app/controllers/tasks_controller.rb

  def show
    @card = Card.find(params[:card_id])
    @task = Task.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

  def new
    @card = Card.find(params[:card_id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @card = Card.find(params[:card_id])
    @task = Task.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

  def create
    @card = Card.find(params[:card_id])
    @task = Task.new(task_params.merge(card_id: params[:card_id]))
    if @task.save
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "created_at", "updated_at", "description", "card_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TEST"], ["created_at", "2020-12-18 14:26:54.376188"], ["updated_at", "2020-12-18 14:26:54.376188"], ["description", "gggg"], ["card_id", 1]]

  def update
    @task = Task.find(params[:id])
    # @card = Card.find(params[:card_id])

    if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["title", "TEST"], ["description", "ffff"], ["updated_at", "2020-11-16 14:04:20.466497"], ["id", 14]]